#include <stdio.h>

int main()
{
    // 定义了一个二维数组，名字叫 a
    // 由 3 个一维数组组成，这个一维数组是 int [4]
    // 这 3 个一维数组的数组名分别为 a[0], a[1], a[2]
    int a[3][4];

    a[0][0] = 0;
    // ...
    a[2][3] = 12;

    // 给数组每个元素赋值
    int i = 0;
    int j = 0;
    int num = 0;
    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 4; j++)
        {
            a[i][j] = num++;
        }
    }

    // 遍历数组，并输出每个成员的值
    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 4; j++)
        {
            printf("%d, ", a[i][j]);
        }
        printf("\n");
    }

    /*
        0, 1, 2, 3,
        4, 5, 6, 7,
        8, 9, 10, 11,
    */

    return 0;
}
